export const QuestionData = [
  {
    id: 1,
    title: "수학적인 사고가 뛰어난가요?",
    answera: "수학을 꽤 잘하는 편이에요!",
    answerb: "수학이랑은 거리가 조금...",
    type: "EI",
  },
  {
    id: 2,
    title: "컴퓨터를 분해하고 조립하는 것에 흥미가 있나요?",
    answera: "새로운 언어와 기술을 배우는 것은 언제나 흥미로워요!",
    answerb: "딱히 관심 없고 두려워요",
    type: "EI",
  },
  // 하드웨어/소프트웨어 e/i
  {
    id: 3,
    title: "디자인과 UI/UX에 관심이 있나요?",
    answera: "무언가를 꾸미고 작업하는걸 좋아해요",
    answerb: "기본이 최고! 그냥 있는 그대로가 좋아요!",
    type: "EI",
  },
  {
    id: 4,
    title: "무언가 새롭고 창의적인 결과물을 만드는 것을 좋아하나요?",
    answera: "새로운 것은 상상하기만 해도 재미있어요!",
    answerb: "아무 생각도 안 들어요..",
    type: "NS",
  },
  {
    id: 5,
    title:
      "본인은 무언가를 해낼 때 기존의 것을 유지하고 개선하는것을 추구하나요?",
    answera: "저만의 방식으로 하는 게 좋아요! ",
    answerb: "기준이 있어야 마음이 편해요!",
    type: "NS",
  },
  {
    id: 6,
    title:
      "팀이나 조직 내 다른 사람들과 협력하거나 의사소통 하는 것을 좋아하나요? ",
    answera: "직접 원인을 찾는 과정은 너무 답답해요",
    answerb: "문제를 해결하고 나면 뿌듯해요! ",
    type: "NS",
  },
  // 개발 유지보수  n / s
  {
    id: 7,
    title: "여러 가지 방법으로 코드를 만드는 것을 좋아하나요?",
    answera: "가능한 방법은 다 써보고싶어요!",
    answerb: "한가지 방법이면 충분해요!",
    type: "FT",
  },
  {
    id: 8,
    title: "평소 생각을 많이 하는 편인가요?",
    answera: "틈만 나면 깊은 생각에 빠져요!",
    answerb: "아무 생각 없이 있을 때가많아요! ",
    type: "FT",
  },
  {
    id: 9,
    title: "어떤 것을 보았을 때 관련된 다른 것들이 많이 떠오르나요?",
    answera: "무언가를 보면 끝도 없이 다른 생각으로 빠져요!",
    answerb: "무언가를 봐도 그것 말고는 다른게 생각나지 않아요 ",
    type: "FT",
  },
  // 창의성   f / t
  {
    id: 10,
    title:
      "혼자 일하는 것보다 팀으로 일하는 것이 더 효율적이고 재미있다고 생각되나요?",
    answera: "팀 프로젝트를 하는 일이 즐거워요!",
    answerb: "팀은 무리 ..! 혼자가 편해요!",
    type: "PJ",
  },
  {
    id: 11,
    title: "타인과 함께 일하는 것이 어렵고 스트레스를 유발한다고 생각하나요?",
    answera: "혼자서 일할 때 효율이 더 늘어요!",
    answerb: "같이 일 할 때 작업 능력이 올라가요!",
    type: "PJ",
  },
  {
    id: 12,
    title: "다른 사람들과 협업하여 문제를 해결하는 것에 관심이 있나요?",
    answera: "협업하는 게 더 좋은 문제 해결 방법이라 생각해요!",
    answerb: "혼자서 할 때가 문제 해결 시 더 좋은 거 같아요!",
    type: "PJ",
  },

  // 협동심/협동심 없 p / j
];
